promts = [
    {
        "id": "dovlatov",
        "from": "Довлатова",
        "promt": """в дальнейшем под писателем будет пониматься: советский и американский писатель и журналист. Сергей Д.
"Познакомьтесь с  {{name}}, который стремится к мудрости и самопознанию через четыре особые покупки, совершенные им в последний месяц. Разгадайте его мир через его собственные мысли и эмоции, связанные с каждой покупкой. Ощутите остроумие и сарказм, с которыми он рассматривает свою жизнь, насмехаясь над жизненными неурядицами и нелепостью повседневности.
Соприкоснитесь с простотой и ясностью стиля писателя, который помогает герою передать свои мысли и события непосредственно и эффективно. Легко погрузитесь в его мир, где короткие предложения создают ощущение разговора с читателем, позволяя герою поделиться своими мыслями и чувствами, создавая иллюзию непосредственного общения.
Погрузитесь в самоанализ и рефлексию {{name}}, который проникается философией и размышляет о жизненных вопросах. Герой откровенно обращается к своему прошлому, анализирует ошибки и неудачи, вплетая элементы автобиографической прозы в свой рассказ. Глубина и эмоциональная проникновенность их текста делает его универсальным и захватывающим.
Попадите в мир {{name}} через его взаимодействия с другими персонажами в магазинах или связанными с его покупками. Позвольте диалогам и небольшим взаимодействиям раскрыть характеры и создать дополнительные сюжетные элементы. Встретьте иронические детали и эпизоды, которые вызывают улыбку и насмешку над повседневными ситуациями, раскрывая комические нюансы жизни.
Возникнут сложности и препятствия на пути героя во время его покупок. Неожиданно ситуация может обернуться напряжением, например, один из желаемых предметов уже продан или магазин закрыт. Эти непредвиденные события создадут драматическое напряжение и увеличат интерес к развитию сюжета.
Используя риторические приемы, такие как метафоры, аналогии и риторические вопросы, создайте сильные образы и усилите эмоциональную нагрузку рассказа, всегда соответствуя стилю писателя.
Завершите рассказ мощной фразой, которая заставит читателя задуматься и почувствовать глубокий смысл истории. Уделите особое внимание грамотности текста и уникальности рассказа, сохраняя при этом характерные особенности стиля писателя."
Рассказ должен состоять из 400-450 слов
{{purchases}}""",
    },
    {
        "id": "freud",
        "from": "Фрейда",
        "promt": """в дальнейшем под писателем будет пониматься: Австрийский психолог, психоаналитик, психиатр и невролог 
"Избавься от внутренних конфликтов и раскрой скрытые аспекты своей психики, погрузившись в захватывающую историю о {{name}}. Позволь {{name}} поделиться своим внутренним монологом, раскрывающим мотивы и символы, связанные с четырьмя особыми покупками, совершенными им в последний месяц. Вдохни жизнь в его мир, используя терминологию и понятия писателя, чтобы проникнуть в глубины его мыслей и эмоций.
Представь интересные взаимодействия {{name}} с персонажами, которые он встречает в магазинах или связаны с его покупками. Включи клинические примеры и случаи из практики, которые иллюстрируют психические процессы героя. Создай небольшие диалоги, чтобы углубить характеризацию и добавить дополнительные сюжетные элементы.
Однако, не всё будет гладко на его пути. Внеси компликации и препятствия, которые возникнут во время покупок. Подбрось неожиданные ситуации, например, разочарование, когда один из желанных предметов окажется уже проданным или магазин окажется закрытым. Это создаст напряжение и добавит интереса к развитию сюжета.
Используй метафоры и образы, чтобы проиллюстрировать сложные психологические концепции и абстрактные идеи. Воплоти в них глубинные эмоциональные состояния и проблемы, влияющие на психическое благополучие {{name}}.
Заверши рассказ мощной фразой, которая вызовет в читателе волнующие мысли и погрузит его в глубокий смысл истории. Сохрани грамотность текста и уникальность рассказа, сочетая их с особенностями стиля писателя."
Рассказ должен состоять из 400-450 слов
{{purchases}}""",
    },
    {
        "id": "lovecraft",
        "from": "Лавкрафта",
        "promt": """"Погрузись в мир {{name}}, исследующего таинственные покупки, раскрывающие мрачные символы и мотивы.
Представь его встречи с загадочными хтоническими персонажами и описания окружающей обстановки, которые вызывают тревожное волнение и ужас. Придай яркость и запоминающиеся черты персонажам, с которыми герой взаимодействует в магазинах или в связи с его покупками.
Раскрой внутренний монолог {{name}}, полный таинственности и неразгаданных мыслей, чтобы погрузить читателя в глубины его психики. 
Внеси пугающие и неясные детали и ситуации, используя неожиданные сравнения и космические детали, чтобы вызвать страх и растерянность у читателя
Создай сюжетные повороты и препятствия, которые добавят напряжения и интереса к развитию истории. Используй метафоры и образы, чтобы передать эмоциональные состояния и проблемы, которые подстерегают {{name}}. 
Заверши рассказ мощной фразой, вызывающей волнующие мысли и погружающей читателя в глубокий смысл происходящего. Создай уникальный и загадочный стиль, который станет подлинным отражением Лавкрафта и его мастерства в создании ужаса и таинственности."
Рассказ должен состоять из 400-450 слов
{{purchases}}""",
    },
    {
        "id": "doncova",
        "from": "Дарьи Донцовой",
        "promt": """в дальнейшем под писателем будет пониматься: Дарья Д. - Русская писательница, сценаристка, радио- и телеведущая, автор большого числа книг в жанре «иронический детектив». По официальным данным Российской книжной палаты, на протяжении ряда лет занимала первое место в России в рейтинге авторов взрослой художественной литературы по суммарному тиражу издаваемых книг в год
"Расскажи захватывающую историю о герое по имени {{name}}, выражая это через четыре особые покупки за последний месяц. Отрази его внутренний монолог, где он с юмором и самоиронией рассуждает о каждой покупке, насмехаясь над стереотипами и нелепостью повседневной жизни.  Погрузи нас в его легкий и доступный мир, используя простой язык, короткие предложения и разговорную речь, чтобы создать комическую атмосферу, характерную для писателя.
 Придай яркость и запоминающиеся черты персонажам, с которыми {{name}} взаимодействует в магазинах или в связи с его покупками. Представь эти персонажи эксцентричными и странными, чтобы придать истории колорит и создать комичные ситуации.  Создай неожиданные повороты сюжета, чтобы удерживать внимание читателя и поддерживать интерес к развитию истории. Внеси комические детали и ситуации, используя неожиданные сравнения и забавные детали, чтобы вызвать смех и удивление у читателя.
Внедри компликации и препятствия на пути {{name}} во время его покупок. Позволь возникнуть неожиданным ситуациям, например, один из желаемых предметов уже продан или магазин закрыт. Такие препятствия добавят напряжения и подчеркнут комическую составляющую истории.
Используй риторические приемы, такие как сарказм, сатира и риторические вопросы, чтобы создать сильные образы и усилить комический эффект рассказа, всегда соответствуя стилю писателя.
Заверши рассказ мощной фразой, которая заставит читателя задуматься и почувствовать глубокий смысл истории. Удели особое внимание грамотности текста и уникальности рассказа, сохраняя при этом характерные особенности стиля писателя.
Твоя задача - вдохновиться стилем писателя и создать захватывающий рассказ, полный ярких и запоминающихся моментов. Разверни свою фантазию и расскажи нам детективную историю о герое, который стремится разгадать преступление, защитить свои интересы и достоинство, а также достичь личного развития и самопознания в процессе расследования."
Рассказ должен состоять из 400-450 слов
{{purchases}}""",
    },
]
